In [1]:
import numpy as np
import pandas as pd

In [2]:
columns = ['W', 'X', 'Y', 'Z']

In [3]:
index = ['A', 'B', 'C', 'D', 'E']

In [4]:
from numpy.random import randint

In [5]:
np.random.seed(42) #seed outputs the same 'random' int 
data = randint(-100,100,(5,4)) # shape

In [6]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [7]:
df = pd.DataFrame(data,index,columns)

In [8]:
df # yo WHATT!

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
type(df['W'])

pandas.core.series.Series

To grab single column:

In [21]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

To grab list of columns:

In [12]:
df[['W', 'Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

To add a new column:

In [13]:
df['new']=df['W']+df['Y']

In [14]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

To remove a column:

In [15]:
df = df.drop('new',axis=1) #axis = 0 refers to rows

In [16]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

Now, we are going to do the same, but with rows

See a row

In [17]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [18]:
df.loc[['A', 'E']]

    W   X   Y   Z
A   2  79  -8 -86
E  30  49 -48 -99

In [24]:
df.iloc[0:3] #you cannot index for columns, only for rows :(

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [28]:
df.drop('C') #by default, axis = 0 , change will not be shown in 'df'

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [29]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [37]:
df.loc[['A','C'],['W']] #this works because you are getting from row A and C from column W

   W
A  2
C  2

In [38]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26